10/data/attachments/142ec4688aff039d.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Alison_interest_Friend_72422_1</nif:username>
            <nif:friendToBeRequested>soap_friends_7a7d4e4f-fd83-4257-a088-faddf684ca2d</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>